#+TITLE: Andrew's Learn Ruby Notes
#+AUTHOR: Andrew Buckingham
#+STARTUP: indent
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+TODO: TODO(t) | | Started(s) | Waiting(w) | Someday/Maybe(m) | Canceled(c) | DONE(d)(@) | Meeting(M) | Note(n)

*** Adding, Subtracting, and Multiplying Integers

*Addition (+)*
    #+BEGIN_SRC ruby
      2 + 2
    #+END_SRC

    #+RESULTS:
    : 4

*Subtraction (-)*
    #+BEGIN_SRC ruby
49 - 47
    
    #+END_SRC

    #+RESULTS:
    : 2

*Multiplication (*)*
    #+BEGIN_SRC ruby
144 * 144
    
    #+END_SRC

    #+RESULTS:
    : 20736

*** Division (/)
    #+BEGIN_SRC ruby
144 / 2
    #+END_SRC

    #+RESULTS:
    : 72

*** Modulo
    #+BEGIN_SRC ruby
16 / 4  # 0
16 / 3  # 5
    
    #+END_SRC

    #+RESULTS:
    : 5

*** Multiplying Floats and Decimals
    #+BEGIN_SRC ruby
15.0 / 4    # 3.75
48.0 * 7.2  # 345.6
    
    #+END_SRC

    #+RESULTS:
    : 3.75

*** String Concatenation
    #+BEGIN_SRC ruby
"I love" + " Ruby!"
    
    #+END_SRC

    #+RESULTS:
    : I love Ruby!

#+BEGIN_SRC ruby
"1" + "1" 
#+END_SRC

#+RESULTS:
: 11

    *We cannot concatenate a string and a number*

#+BEGIN_SRC ruby
1 + "Love"
#+END_SRC    

#+RESULTS:
-:3:in `+': String can't be coerced into Fixnum (TypeError)
	from -:3:in `main'
	from -:5:in `<main>'

*** Arrays

    #+BEGIN_SRC ruby
[1,2,3,4]
    
    #+END_SRC

    #+RESULTS:
    | 1 | 2 | 3 | 4 |

    Predictably, the index starts with 0:

    #+BEGIN_SRC ruby
    [1, 2, 3, 4] [1]
    #+END_SRC

    #+RESULTS:
    : 2

*** Hashes {}
    - Function as dictionary/key-value pairs

      #+BEGIN_SRC ruby
{:cat => 'meows'}
      
      #+END_SRC

      #+RESULTS:
      | :cat=> | meows |

    We can add more values:
    #+BEGIN_SRC ruby
{:dog => 'barks', :cat => 'meows', :pig => 'oinks'}
    
    #+END_SRC

    #+RESULTS:
    | :dog=> | barks | :cat=> | meows | :pig=> | oinks |

    To find the value of one of the hashes:
    #+BEGIN_SRC ruby
{:dog => 'barks', :cat => 'meows', :pig => 'oinks'} [:cat]  # meows
    
    #+END_SRC

    #+RESULTS:
    : meows

